tutorials/incompressibleFluid/turbineSiting/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField
{
    type            atmosphericBoundaryLayerVelocity;
    libs            ("libatmosphericModels.so");
}

boundaryField
{
    outlet
    {
        $internalField;
    }

    inlet
    {
        $internalField;
    }

    terrain
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    ground
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
